RIET/src/Catalogs/СканированныеДокументыДляПередачиВЭлектронномВиде/СканированныеДокументыДляПередачиВЭлектронномВиде.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СканированныеДокументыДляПередачиВЭлектронномВиде</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыПредставляемыхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОснования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыУчастников</name>
    <attributes>
      <name>РольУчастника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЮрЛицоНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЮрЛицоИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЮрЛицоКПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицоФамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицоИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицоОтчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицоИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяЮрЛицом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Enums/ВидыПредставляемыхДокументов/ВидыПредставляемыхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПредставляемыхДокументов</name>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>КнигаПокупок</name>
  </enumValues>
  <enumValues>
    <name>КнигаПродаж</name>
  </enumValues>
  <enumValues>
    <name>ЖурналПолученныхИВыставленныхСчетовФактур</name>
  </enumValues>
  <enumValues>
    <name>ТоварноТранспортнаяНакладная</name>
  </enumValues>
  <enumValues>
    <name>АктПриемкиСдачиРабот</name>
  </enumValues>
  <enumValues>
    <name>ГрузоваяТаможеннаяДекларация</name>
  </enumValues>
  <enumValues>
    <name>ДобавочныйЛистГрузовойТаможеннойДекларации</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйЛистКнигиПокупок</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйЛистКнигиПродаж</name>
  </enumValues>
  <enumValues>
    <name>ТоварнаяНакладнаяТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>СпецификацияЦены</name>
  </enumValues>
  <enumValues>
    <name>ДополнениеКДоговору</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/СканированныеДокументыДляПередачиВЭлектронномВиде/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ОшибкаЗаполнения Экспорт;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("Справочники.Организации");
        Организация = Модуль.ОрганизацияПоУмолчанию();
	КонецЕсли;

	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	КонтекстЭДОСервер.ОбработкаЗаполненияОбъекта(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	КонтекстЭДОСервер.ПриЗаписиОбъекта(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	КонтекстЭДОСервер.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения (Отказ, ПроверяемыеРеквизиты)
	// формируем соответствие для колучения кода вида документа
	КодПоВидуДокумента = ПолучитьСоответствиеКодПоВидуДокумента();
	КодДок = КодПоВидуДокумента[ВидДокумента];
	
	Если КодДок <> "0924" И КодДок <> "1665" И КодДок <> "2181" 
	   И КодДок <> "2330" И КодДок <> "2234" И КодДок <> "2745"
	   И КодДок <> "2766" И КодДок <> "2772" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаДокумента")); 
	КонецЕсли; 
	
	Если КодДок <> "0924" И КодДок <> "1665" И КодДок <> "2215" 
	   И КодДок <> "2216" И КодДок <> "2330" И КодДок <> "2745"
	   И КодДок <> "2766" И КодДок <> "2772" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерДокумента")); 
	КонецЕсли;
	
	//Если КодДок <> "0924" И КодДок <> "1665" И КодДок <> "2181" 
	//   И КодДок <> "2330" И КодДок <> "2234" И КодДок <> "2772" Тогда
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СуммаВсего")); 
	//КонецЕсли;
	//
	//Если КодДок <> "0924" Тогда
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СуммаНалога")); 
	//КонецЕсли;

	Если КодДок <> "1665" И КодДок <> "2181" И КодДок <> "2216" 
	   И КодДок <> "2330" И КодДок <> "2745" И КодДок <> "2772" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерОснования")); 
	КонецЕсли;
	
	Если КодДок <> "1665" И КодДок <> "2181" И КодДок <> "2330" 
	   И КодДок <> "2745" И КодДок <> "2772" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаОснования")); 
	КонецЕсли;
	
	Если КодДок <> "2745" И КодДок <> "2330" И КодДок <> "2766" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПредметДокумента")); 
	КонецЕсли; 
	
	Если КодДок <> "0924" И КодДок <> "1665" И КодДок <> "2181" 
	   И КодДок <> "2330" И КодДок <> "2234" И КодДок <> "2745"
	   И КодДок <> "2766" И КодДок <> "2772" Тогда
	   ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("РеквизитыУчастников")); 
   КонецЕсли;
   
   // Обходим строки и проверяем заполнение реквизита
   Для Индекс = 1 по РеквизитыУчастников.Количество() Цикл
	   Индекс0 = Индекс - 1;
	   РеквизитыУчастника = РеквизитыУчастников.Получить(Индекс0);
	   
	   Если РеквизитыУчастника.ЯвляетсяЮрЛицом Тогда
		   //для юридического лица
		   
		   Если Не ЗначениеЗаполнено(РеквизитыУчастника.ЮрЛицоНаименование) Тогда
			   Сообщение = Новый СообщениеПользователю();
			   Сообщение.Текст = "В строке " + Индекс + " таблицы ""Участники сделки"" не заполнено значение ""Полное наименование организации""";
			   Сообщение.Поле = "ТаблицаУчастников[" + Индекс0 + "].СоставноеПоле";
			   Сообщение.УстановитьДанные(ЭтотОбъект);
			   Сообщение.Сообщить();
			   Отказ = Истина;
		   КонецЕсли;
		   
		   Если КодДок = "2181" ИЛИ КодДок = "2330" ИЛИ КодДок = "2745" ИЛИ КодДок = "2766" Тогда
			   
			   Если Не ЗначениеЗаполнено(РеквизитыУчастника.ЮрЛицоИНН) Тогда
				   Сообщение = Новый СообщениеПользователю();
				   Сообщение.Текст = "В строке " + Индекс + " таблицы ""Участники сделки"" не заполнено значение ""ИНН организации""";
				   Сообщение.Поле = "ТаблицаУчастников[" + Индекс0 + "].СоставноеПоле";
				   Сообщение.УстановитьДанные(ЭтотОбъект);
				   Сообщение.Сообщить();
				   Отказ = Истина;
			   КонецЕсли;
			   
		   КонецЕсли;
		   
	   Иначе
		   //для физического лица
		   
		   Если НЕ ЗначениеЗаполнено(РеквизитыУчастника.ФизЛицоФамилия) Тогда
			   Сообщение = Новый СообщениеПользователю();
			   Сообщение.Текст = "В строке " + Индекс + " таблицы ""Участники сделки"" не заполнено значение ""Фамилия физического лица""";
			   Сообщение.Поле = "ТаблицаУчастников[" + Индекс0 + "].СоставноеПоле";
			   Сообщение.УстановитьДанные(ЭтотОбъект);
			   Сообщение.Сообщить();
			   Отказ = Истина;
		   КонецЕсли;
		   
		   Если НЕ ЗначениеЗаполнено(РеквизитыУчастника.ФизЛицоИмя) Тогда
			   Сообщение = Новый СообщениеПользователю();
			   Сообщение.Текст = "В строке " + Индекс + " таблицы ""Участники сделки"" не заполнено значение ""Имя физического лица""";
			   Сообщение.Поле = "ТаблицаУчастников[" + Индекс0 + "].СоставноеПоле";
			   Сообщение.УстановитьДанные(ЭтотОбъект);
			   Сообщение.Сообщить();
			   Отказ = Истина;
		   КонецЕсли;
		   
		   //отменяем проверку для физ лица - в случае отсутствия ИНН выгружаем 12 нулей
		   // Если КодДок = "2181" ИЛИ КодДок = "2330" ИЛИ КодДок = "2745" ИЛИ КодДок = "2766" Тогда
		   //	
		   //	Если Не ЗначениеЗаполнено(РеквизитыУчастника.ФизЛицоИНН) Тогда
		   // 	   Сообщение = Новый СообщениеПользователю();
		   // 	   Сообщение.Текст = "В строке " + Индекс + " таблицы ""Участники сделки"" не заполнено значение ""ИНН физического лица""";
		   // 	   Сообщение.Поле = "РеквизитыУчастников[" + Индекс0 + "].ФизЛицоИНН";
		   // 	   Сообщение.УстановитьДанные(ЭтотОбъект);
		   // 	   Сообщение.Сообщить();
		   // 	   Отказ = Истина;
		   //	КонецЕсли;
		   //	
		   //КонецЕсли;
		   
	   КонецЕсли;
	   
   КонецЦикла;
   
КонецПроцедуры

//вспомогательная для ОбработкаПроверкиЗаполнения 
Функция ПолучитьСоответствиеКодПоВидуДокумента()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.СчетФактура,								"0924");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ТоварноТранспортнаяНакладная, 				"1665");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.АктПриемкиСдачиРабот, 						"2181");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ГрузоваяТаможеннаяДекларация, 				"2215");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ДобавочныйЛистГрузовойТаможеннойДекларации, "2216");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ТоварнаяНакладнаяТОРГ12, 					"2234");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.СпецификацияЦены, 							"2330");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ДополнениеКДоговору, 						"2745");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.Договор, 									"2766");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.КорректировочныйСчетФактура,				"2772");
	
	Возврат Соответствие;
	
КонецФункции

#КонецЕсли
